Repository: GNOME/pybliographer
Catalog: po/*.po
Languages: eu

source: Framework for working with bibliographic databases
eu: Datu-base bibliografikoekin aritzeko lan-markoa

source: Pybliographer is a tool for managing bibliographic databases. It can be used for searching, editing, reformatting, etc. In fact, it’s a simple framework that provides easy to use python classes and functions, and therefore can be extended to many uses (generating HTML pages according to bibliographic searches, etc).
eu: Pybliographer datu-base bibliografikoak kudeatzeko tresna bat da. Bilaketak egiteko, editatzeko, formatua aldatzeko eta abar erabili daiteke. Izatez, erraz erabiltzen diren Python klaseak eskaintzen dituen lan-marko sinple bat da, eta beraz, erabilera askotarako hedatu daiteke (HTML orriak sortzea bilaketa bibliografikoen arabera, etab.)

source: In addition to the scripting environment, a graphical Gnome interface is available. It provides powerful editing capabilities, a nice hierarchical search mechanism, direct insertion of references into LyX, direct queries on Medline, and more. It currently supports the following file formats: BibTeX, ISI, Medline, Ovid, Refer.
eu: Scripten inguruneaz gain, GNOME interfaze grafikoa ere eskaintzen du. Edizioko ahalmen sendoak, bilaketak egiteko mekanismo hierarkiko ona, LyX aplikazioan erreferentziak zuzenean txertatzeko aukera, Medilinen kontsulta zuzenak egitea, eta beste hamaika eginbide eskaintzen ditu. Honako fitxategi-formatuak onartzen ditu: BibTeX, ISI, Medline, Ovid, Refer.

source: The main window
eu: Leiho nagusia

source: Editing an entry
eu: Sarrera bat editatzea

source: Bibliography Manager
eu: Bibliografia-kudeatzailea

source: Manage bibliographic databases
eu: Kudeatu datu-base bibliografikoak

source: warning: can’t import %s: %s
eu: abisua: ezin da %s inportatu: %s

source: value of “%s” should be of type %s
eu: “%s” balioak %s motakoa izan behar luke

source: String
eu: Katea

source: Boolean
eu: Boolearra

source: Integer
eu: Osokoa

source: Integer under %d
eu: %d azpiko zenbaki osoa

source: Integer over %d
eu: %d gaineko zenbaki osoa

source: Integer between %d and %d
eu: %d eta %d arteko zenbaki osoa

source: Element in “%s”
eu: Elementua “%s”(e)n

source: Tuple (%s)
eu: Tupla (%s)

source: List (%s)
eu: Zerrenda (%s)

source: Dictionary (%s, %s)
eu: Hiztegia (%s, %s)

source: warning: could not restore setting %r to %r: %s
eu: abisua: ezin izan da %r ezarpena leheneratu eta %r bihurtu: %s

source: Illegal year value
eu: baliogabeko urte balioa

source: Illegal month value
eu: baliogabeko hilabete balioa

source: Illegal day value
eu: baliogabeko egun balioa

source: in %s
eu: %s(e)n

source: key “%s” is malformed
eu: “%s” gakoa gaizki formatuta dago

source: %s:%d: key “%s” already defined
eu: %s:%d: “%s” gakoa dagoeneko definituta dago

source: Some changes require to restart Pybliographic to be correctly taken into account
eu: Zenbait aldaketak Pybliographic berrabiaraztea eskatzen dute behar den moduan kontuan har daitezen

source: Add
eu: Gehitu

source: Update
eu: Eguneratu

source: Remove
eu: Kendu

source: Set
eu: Ezarri

source: Key:
eu: Gakoa:

source: Value:
eu: Balioa:

source: _File
eu: _Fitxategia

source: _Edit
eu: _Editatu

source: _View
eu: _Ikusi

source: _Cite
eu: _Aipatu

source: _Settings
eu: E_zarpenak

source: _Help
eu: _Laguntza

source: Recent documents
eu: Azken dokumentuak

source: Open a file
eu: Ireki fitxategia

source: Open _Location…
eu: Ireki _kokalekua…

source: Save the current file
eu: Uneko fitxategia gordetzen du

source: Merge With…
eu: Batu honekin…

source: Medline Query…
eu: Medline kontsulta…

source: Add a new entry
eu: Gehitu sarrera berria

source: S_ort…
eu: O_rdenatu…

source: Cite…
eu: Aipatu…

source: Cite key(s)
eu: Aipatu gakoa(k)

source: Format…
eu: Formatua…

source: Fields…
eu: Eremuak…

source: Forget all changes
eu: Ahaztu aldaketa guztiak

source: _Resource
eu: _Baliabidea

source: Unnamed bibliographic database
eu: Izenik gabeko datu-base bibliografikoa

source: can’t open file “%s” for writing: %s
eu: Ezin da “%s” fitxategia ireki idazteko: %s

source: Error while parsing “%s”: %s
eu: Errorera“%s” analizatzean: %s

source: New database
eu: Datu-base berria

source: [no entry]
eu: [sarrerarik ez]

source: [1 entry]
eu: [sarrera bat]

source: [%d entries]
eu: [%d sarrera]

source: [%d/1 entry]
eu: [%d/1 sarrera]

source: [%d/%d entries]
eu: [%d/%d sarrera]

source: [modified]
eu: [aldatua]

source: view limited to: %s
eu: bistaren muga: %s

source: The database has been modified. Save changes?
eu: Datu-basea aldatu egin da. Aldaketak gorde?

source: The database has been externally modified. Overwrite changes?
eu: Datu-basea kanpoan aldatu da. Aldaketak gainidatzi?

source: Your query returned no result
eu: Zure kontsultak ez du emaitzarik itzuli

source: An error occurred during Medline Query
eu: Errorea gertatu da Medline kontsultatzean

source: Merge file
eu: Konbinatu fitxategia

source: Open error
eu: Irekitze-errorea

source: Merge status
eu: Konbinazioaren egoera

source: Open file
eu: Ireki fitxategia

source: An autosave file was found which is newer than the original file. Do you want to restore it?
eu: Automatikoki gordetako fitxategi bat aurkitu da eta jatorrizko fitxategia baino berriagoa da. Leheneratu nahi duzu?

source: Unable to remove autosave file “%s”: %s
eu: Ezin da gordetze automatikoko “%s” fitxategia kendu: %s

source: Error during autosaving: %s
eu: Errorea automatikoki gordetzean: %s

source: Unable to save “%s”: %s
eu: Ezin izan da “%s” gorde: %s

source: An internal error occurred during saving Try to Save As…
eu: Barne-errorea gertatu da gordetzean. Saiatu 'Gorde honela…' erabilita

source: Save As…
eu: Gorde honela…

source: The file “%s” already exists. Overwrite it?
eu: “%s” fitxategia badago lehendik ere. Gainidatzi?

source: During opening: %s
eu: Irekitzean: %s

source: Reopen error
eu: Errorea berriro irekitzean

source: An entry called “%s” already exists. Rename and add it anyway?
eu: “%s” deitzen den sarrera badago lehendik ere. Aldatu izena eta gehitu?

source: Really remove all the entries?
eu: Benetan kendu nahi dituzu sarrera guztiak?

source: Create new entry
eu: Sortu sarrera berria

source: Really edit %d entries?
eu: Benetan editatu nahi dituzu %d sarrera?

source: Remove all the %d entries?
eu: Kendu %d sarrera guztiak?

source: Remove entry “%s”?
eu: Kendu “%s” sarrera?

source: your search text must contain latin-1 characters only
eu: Zure bilaketak latin-1 karaktereak soilik eduki behar ditu

source: Can’t connect to LyX: %s
eu: Ezin da LyX aplikazioarekin konektatu: %s

source: Select a column to search in first
eu: Hautatu zutabe bat, lehenengo hartan bilatzeko

source: Searching for “%s”…
eu: “%s” bilatzen…

source: Cannot find “%s”…
eu: Ezin da “%s” aurkitu…

source: Can’t display documentation: %s
eu: Ezin da dokumentazioa bistaratu: %s

source: GNOME Translation Team
eu: GNOME itzulpen-taldea

source: This program is copyrighted under the GNU GPL
eu: Programa hau GNU GPL lizentzia pean dago

source: GNOME interface to the Pybliographer system.
eu: GNOME interfazea Pybliographer sistemarako.

source: Pybliographer Home Page
eu: Pybliographer webgunea

source: Last Name, First Name
eu: Abizena, Izena

source: Text
eu: Testua

source: Error in native string parsing
eu: Errorea jatorrizko kate-analisian

source: Day
eu: Eguna

source: Month
eu: Hila

source: Year
eu: Urtea

source: Delete
eu: Ezabatu

source: [ Drop an Entry here ]
eu: [ Jaregin sarrera bat hemen ]

source: Browse…
eu: Arakatu…

source: Select file
eu: Hautatu fitxategia

source: Entry type
eu: Sarrera mota

source: Key
eu: Gakoa

source: Create Field
eu: Sortu eremua

source: Back
eu: Atzera

source: Next
eu: Hurrengoa

source: Mandatory
eu: Derrigorrezkoa

source: Optional
eu: Aukerakoa

source: Extra
eu: Gehigarria

source: Invalid key format
eu: Baliogabeko gako-formatua

source: Key “%s” already exists
eu: “%s” gakoa badago lehendik ere

source: The “%s” field contains a non Latin-1 symbol
eu: “%s” eremuak Latin-1 ez den ikur bat du

source: Your text contains non Latin-1 symbols
eu: Zure testuak Latin-1 ez diren ikurrak ditu

source: Edit entry
eu: Editatu sarrera

source: Native Editing
eu: Jatorrizko edizioa

source: Standard Editing
eu: Edizio estandarra

source: mandatory
eu: derrigorrezkoa

source: Enter text here
eu: Sartu testua hemen

source: New Annotation Name
eu: Oharpenaren izen berria

source: Name of the new annotation:
eu: Oharpen berriaren izena:

source: Cannot open URL: %s
eu: Ezin da URLa ireki: %s

source: Authors
eu: Egileak

source: Long Text
eu: Testu luzea

source: URL
eu: URLa

source: Reference
eu: Erreferentzia

source: Date
eu: Data

source: Name
eu: Izena

source: Type
eu: Mota

source: Available
eu: Erabilgarri

source: Associated
eu: Lotua

source: Please, select an entry type from previous page.
eu: Hautatu sarrera mota bat aurreko orrian.

source: Fields associated with <b>%s</b> entry type
eu: <b>%s</b> sarrera motari lotutako eremuak

source: File
eu: Fitxategia

source: Bibliography type:
eu: Bibliografia mota

source: — According to file suffix —
eu: — Fitxategi-atzizkiaren arabera —

source: Full database
eu: Datu-base betea

source: internal error during evaluation
eu: barne-errorea ebaluazioan

source: while compiling %s error: %s
eu: %s konpilatzean errorea: %s

source: [Entry Type]
eu: [Sarrera mota]

source: [Key Value]
eu: [Gako-balioa]

source: The following errors occurred:
eu: Honako erroreak gertatu dira:

source: This is Pybliographic %s [Python %s, Gtk %s, PyGTK %s]
eu: Hau Pybliographic %s da [Python %s, Gtk %s, PyGTK %s]

source: Pybliographer Configuration
eu: Pybliographer konfigurazioa

source: Entry types and field names configuration
eu: Sarrera moten eta eremu-izenen konfigurazioa

source: Name
eu: Izena

source: Editor
eu: Editorea

source: Fields
eu: Eremuak

source: Select an entry type and specify its associated (mandatory and optional) fields on the next page.
eu: Hautatu sarrera mota bat eta zehaztu hari lotutako (derrigorrezko eta aukerako) eremuak hurrengo orrian.

source: Entries
eu: Sarrerak

source: Information for <b>Article</b> entry type
eu: Informazioa <b>Artikulua</b> sarrera motarako

source: Association
eu: Elkarketa

source: Format entries
eu: Eman formatu sarrerei

source: Bibliography style:
eu: Estilo bibliografikoa:

source: Output format:
eu: Irteerako formatua:

source: Output file:
eu: Irteerako fitxategia:

source: Save formatted as
eu: Gorde formatua honela:

source: Medline Query
eu: Medline kontsulta

source: Enter your Medline Query
eu: Sartu zure Medline kontsulta

source: Search PubMed for:
eu: Bilatu PubMed-en honakoa:

source: Maximum number of results:
eu: Gehieneko emaitza kopurua:

source: Starting listing at result number:
eu: Zerrenda honako emaitza-zenbakian hasten:

source: Only items with abstracts
eu: Laburpenak dituzten elementuak soilik

source: Only items ahead of print
eu: Inprimatze-aurreko elementuak soilik

source: From:
eu: Nondik:

source: To:
eu: Hona:

source: Use the format YYYY/MM/DD Month and day are optional.
eu: Erabili UUUU/HH/EE formatua Hilabetea eta eguna aukerakoak dira.

source: Limited to:
eu: Muga honekin:

source: Open Location
eu: Ireki kokalekua

source: Enter the location (URI) of the file you would like to open:
eu: Sartu ireki nahi duzun fitxategiaren kokalekua (URIa):

source: Search
eu: Bilatu

source: Field
eu: Eremua

source: Pattern
eu: Eredua

source: Simple Search
eu: Bilaketa erraza

source: Query
eu: Kontsulta

source: Expert Search
eu: Bilaketa aditua

source: Select sort criteria
eu: Hautatu ordenatze-irizpideak

source: Set as default
eu: Ezarri lehenetsi gisa

source: no input pipe “%s”
eu: ez dago sarrerako “%s” kanalizaziorik

source: no output pipe “%s”
eu: ez dago irteerako “%s” kanalizaziorik

source: method “%s” provides no opener
eu: “%s” metodoak ez du irekitzailerik eskaintzen

source: File “%s” does not exist
eu: “%s” fitxategia ez da existitzen

source: don’t know how to open “%s”
eu: ez daki “%s” nola ireki

source: method “%s” provides no iterator
eu: “%s” metodoak ez du iteratzailerik eskaintzen

source: Warning: This URL is marked as Invalid or Approximate: %s Continue?
eu: Abisua: URL hau baliogabeko edo ez zehatz gisa markatu da: %s Jarraitu?

source: Determining Mime Type…
eu: MIME mota zehazten…

source: Cannot determine mime type for item %s
eu: Ezin izan da %s elementuaren MIME mota zehaztu

source: URL in question is: %s You should check the url or path given for errors. Details: %s
eu: URLa honakoa da: %s URLa edo bidea egiaztatu beharko zenituzke. Xehetasunak: %s

source: Accessing resource…
eu: Baliabidea atzitzen…

source: IOError for item %s: cannot uncompress resource.
eu: IOError errorea %s elementurako: ezin da baliabidea deskonprimitu.

source: URL: %s Details: %s
eu: URLa: %s Xehetasunak: %s

source: Starting application…
eu: Aplikazioa abiarazten…

source: No application to view resource
eu: Ez dago aplikaziorik baliabidea bistaratzeko

source: For mime type %s, no entry found in configuration option resource/viewers. Please consider adding one. URL: %s
eu: %s MIME motarako, ez da sarrerarik aurkitu baliabideen/ikustaileen konfigurazio-aukeretan. Horietako bat gehitzea ondo legoke. URLa: %s

source: missing “%s” attribute
eu: “%s” atributua falta da

source: invalid opening tag: %s
eu: baliogabeko irekitze-etiketa: %s

source: invalid closing tag: %s
eu: baliogabeko ixte-etiketa: %s

source: This is %s, version %s
eu: Hau %s da, %s bertsioa

source: This is free software with ABSOLUTELY NO WARRANTY.
eu: Hau software librea da, BERMERIK GABEKOA.

source: For details, type “warranty”.
eu: Xehetasunetarako, idatzi “warranty”.

source: %s: error: can’t open file “%s”
eu: %s: errorera: ezin da “%s” fitxategia ireki

source: For help, run %s and type “help” at the prompt
eu: Laguntzarako, exekutatu %s eta idatzi “help” gonbitean

source: Useful commands: help to get some help quit to quit
eu: Komando erabilgarriak: help laguntza eskuratzeko quit irteteko

source: usage: pybliocheck <file | directory>…
eu: erabilera: pybliocheck <fitxategia | direktorioa>…

source: file “%s” is ok [%d entry]
eu: “%s” fitxategia ondo dago [sarrera %d]

source: usage: pybliocompact <latexfile> <bibtexfiles…>
eu: erabilera: pybliocompact <latex-fitxategia> <bibtex-fitxategiak…>

source: pybliocompact: error: %s
eu: pybliocompact: errorea: %s

source: no entry
eu: sarrerarik ez

source: can’t find the following entries: %s
eu: ezin dira honako sarrerak aurkitu: %s

source: usage: pyblioconvert <source>..<target> <input> [output]
eu: erabilera: pyblioconvert <iturburua>..<helburua> <sarrera> [irteera]

source: pyblioconvert: error: bad conversion format
eu: pyblioconvert: errorea: bihurketarako formatu okerra

source: usage: pyblioformat [options] <database…> options: -o file, --output=file specify an output filename -s style, --style=style specify a bibliography style -f format, --format=format specify an output format -H header, --header=header defines a header file -F footer, --footer=footer defines a footer file -l 'output', --list='output' lists the available output formats -h, --help show this help message
eu: erabilera: pyblioformat [aukerak] <datu-basea…> aukerak: -o fitxategia, --output=fitxategia zehaztu irteerako fitxategia -s estiloa, --style=estiloa zehaztu estilo bibliografikoa -f formatua, --format=formatua zehaztu irteerako formatua -H goiburua, --header=goiburua definitu goiburu-fitxategia -F orri-oina, --footer=orri-oina definitu orri-oinaren fitxategia -l 'irteera', --list='irteera' zerrendatu irteerako formatu erabilgarriak -h, --help erakutsi laguntza-mezu hau

source: pyblioformat: error: %s
eu: pyblioformat: errorea: %s

source: pyblioformat: warning: %s
eu: pyblioformat: abisua: %s

source: can’t open “%s”: %s
eu: ezin da “%s” ireki: %s

source: unknown list “%s”
eu: “%s” zerrenda ezezaguna

source: pyblioformat: available values for “%s”:
eu: pyblioformat: “%s” objekturako balio erabilgarriak:

source: empty value list “%s”
eu: balioen “%s” zerrenda hutsa

source: too few arguments
eu: argumentu gutxiegi

source: unknown output format “%s”
eu: irteerako “%s” formatu ezezaguna

source: can’t find style “%s”
eu: ezin da “%s” estiloa aurkitu

source: pyblioformat: using style “%s”, format “%s”
eu: pyblioformat: “%s” estiloa, “%s” formatua erabiltzen

source: can’t open header “%s”: %s
eu: ezin da “%s” goiburua ireki: %s

source: can’t open database: %s
eu: ezin da datu-basea ireki: %s

source: can’t open footer “%s”: %s
eu: ezin da “%s” orri-oina ireki: %s

source: usage: pybliotex <latexfile> [bibtexfiles…]
eu: erabilera: pybliotex <latex-fitxategia> [bibtex-fitxategiak…]

source: pybliotex: error: %s
eu: pybliotex: errorea: %s

source: pybliotex: warning: the following keys were not resolved
eu: pybliotex: abisua: honako gako-hitzak ez dira ebatzi

source: no style defined
eu: ez da estilorik definitu

source: usage: pybliotext [-o outputfile] [-s style] <textfile> <bibfiles…>
eu: erabilera: pybliotext [-o irteera-fitxategia] [-s estiloa] <testu-fitxategia> <bib-fitxategiak…>

source: pybliotext: error: %s
eu: pybliotext: errorea: %s

source: pybliotext: warning: %s
eu: pybliotext: abisua: %s

source: File already exists: “%s”
eu: Fitxategia badago lehendik: “%s”

source: A file with the same name already exists: “%s”
eu: Badago izen bera duen fitxategi bat: “%s”

source: no citation found
eu: ez da aipamenik aurkitu

source: pybliotext: using style “%s”, format “%s”
eu: pybliotext: “%s” estiloa, “%s” formatua erabiltzen

source: can’t create “%s”
eu: ezin da “%s” sortu

source: can’t remove “%s”
eu: ezin da “%s” kendu

source: Done
eu: Eginda
